/*==============================================================*/
/* DBMS name:      MySQL 5.6                                    */
/* Created on:     2018/8/28 10:40:10                           */
/*==============================================================*/


/*================================================================================================================================================*/
/*                                    支撑表 一些边缘的功能不一定用得上 先预备着                                                                        */
/*================================================================================================================================================*/
-- #河流表 所流经的河流信息
-- DROP TABLE IF EXISTS `d_deviceinfo_log`;
-- CREATE TABLE `d_deviceinfo_log` (
-- `id`  int(11) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '自增主键' ,
-- `name`  VARCHAR (100) UNSIGNED NOT NULL COMMENT '河流名称' ,
-- PRIMARY KEY (`id`) ,
-- )
-- COMMENT='设备日志表'
-- ;
DROP TABLE  IF EXISTS `d_deviceinfodata_pollution`;
CREATE TABLE `d_deviceinfodata_pollution` (
  `id`  bigint  NOT NULL AUTO_INCREMENT COMMENT '自增主键' ,
  `name`  VARCHAR (100)  NOT NULL COMMENT '名称' ,

  `suspension`  float(10,3)  DEFAULT  NULL COMMENT '悬浮物' ,
  `mercury`   float(10,3)  DEFAULT  NULL COMMENT '总汞' ,
  `ph`   float(10,3)  DEFAULT  NULL COMMENT 'ph值' ,
  `organic_carbon`   float(10,3)  DEFAULT  NULL COMMENT '总有机碳' ,
  `lead`   float(10,3)  DEFAULT  NULL COMMENT '总铅' ,

  `create_date`  datetime NOT NULL COMMENT '记录生成时间' ,
  `devicegps_id` int(11) UNSIGNED NOT NULL COMMENT '设备编号' ,
  PRIMARY KEY (`id`)
)
COMMENT='设备数据-污染信息表'
;
/*================================================================================================================================================*/
/*                                       基础权限导入数据                            */
/*================================================================================================================================================*/



/*================================================================================================================================================*/
/*                                       导入数据                            */
/*================================================================================================================================================*/